using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S1001 : TextScript
    {
        public S1001(Hashtable gVars, Hashtable lVars, GameObject root, PanelSwitch ps):base(gVars, lVars, root, ps) { }
        public override void Init()
        {
            base.Init();
            pieces = new List<Piece>()
            {
                //——背景 书法社——
                f.t("【李云萧】", "这里是……"),
                f.t("【李云萧】", "（在教室的外侧，陈列着一幅幅的书法作品。）"),
                f.t("【？？？】", "李云萧？"),
                f.t("【李云萧】", "？？（谁叫我？）"),
                f.t("【？？？】", "你怎么会来这里？"),
                f.t("【李云萧】", "额，请问、你是谁？"),
                f.t("【？？？】", "昨天我们不才见过面吗？我是苏梦忆啊。"),
                f.t("【李云萧】", "苏、苏梦忆？"),
                f.t("【李云萧】", "啊！你、你是班长？"),
                f.t("【苏梦忆】", "呵呵呵，你还能记得我是班长啊。"),
                f.t("【李云萧】", "抱歉，苏梦忆，同学们的名字，我还记不清楚。"),
                f.t("【苏梦忆】", "没关系，时间久了就好。"),
                f.t("【苏梦忆】", "我高一开学的时候，也记不住其他同学的名字呢。"),
                f.t("【李云萧】", "苏梦忆，我永远记住了。"),
                f.t("【苏梦忆】", "对了，你是想加入书法社吗？"),
                f.t("【李云萧】", "书、书法社？"),
                f.t("【苏梦忆】", "这里是书法社的活动教室，我看你站在这里以为你想加入呢。"),
                f.t("【李云萧】", "诶？难道你是书法社的成员？"),
                f.t("【苏梦忆】", "不，我没有加入书法社，不过……"),
                f.t("【苏梦忆】", "书法社的社长，是我的好朋友，我和她从小就认识了。"),
                f.t("【苏梦忆】", "所以，我偶尔会过来看看她，顺便参加书法社的活动。"),
                f.t("【李云萧】", "哦，是这样啊。"),
                f.t("【李云萧】", "那，书法社平时有些什么活动呢？"),
                f.t("【苏梦忆】", "平时的话，大家一起欣赏欣赏书法，练练字，硬笔和软笔都有。"),
                f.t("【李云萧】", "那你的字，一定写得非常漂亮。"),
                f.t("【苏梦忆】", "哪有，我的书法在这里，只能算作是普通水平。"),
                f.t("【李云萧】", "要我的话，肯定是垫底了，小时候的书法班都逃掉了。"),
                f.t("【李云萧】", "平时也没有好好练过，我的字很丑的。"),
                f.t("【苏梦忆】", "那你正好可以进书法社，和大家一起练习书法，慢慢就会好上去的。"),
                f.t("【李云萧】", "额……（和他们在一起写字，压力估计会很大吧……）"),
                f.t("【李云萧】", "对了，还有些什么活动呢？"),
                f.t("【苏梦忆】", "嗯，我想想……周末还会一起去看书法展览。"),
                f.t("【李云萧】", "书法社会在学校里进行展出吗？"),
                f.t("【苏梦忆】", "在我记忆里，好像还没有举办过，通常我们都是去市美术馆看的。"),
                f.t("【苏梦忆】", "不过，我也有听说，这学期要举办一次校内的展览。"),
                f.t("【李云萧】", "到时候，我一定会去看的。"),
                f.t("【苏梦忆】", "哦，你应该一个社团都没有加入吧？"),
                f.t("【李云萧】", "没有，我都不知道有哪些社团。"),
                f.t("【苏梦忆】", "每个学期开学的时候，可以加入自己想进的社团。"),
                f.t("【苏梦忆】", "但是一旦加入，除非有特殊情况，只能到学期结束再退出。"),
                f.t("【苏梦忆】", "下周，全校会举行一次招新，那天所有的社团都会摆摊。"),
                f.t("【李云萧】", "总共有多少社团啊，那岂不是很难选择？"),
                f.t("【苏梦忆】", "大约有20多个，我高一的时候，也挑了很久呢。"),
                f.t("【李云萧】", "那我得好好考虑一下了。"),
                f.t("【李云萧】", "这一整层都是社团的专用教室？"),
                f.t("【苏梦忆】", "是的，不止这一层，上面的几层，都拿来作活动教室了。"),
                f.t("【苏梦忆】", "因为初高中加起来只占用了两栋教学楼，三号楼就空出来了。"),
                f.t("【李云萧】", "哦……（华欣的学生数量会不会太少了点？）"),
                f.t("【李云萧】", "对了，我还没有问你，你是什么社团的？"),
                f.t("【苏梦忆】", "这个嘛……不告诉你"),
                f.t("【李云萧】", "（不会，没有加入社团吧？）"),
                //——SE 上课铃——
                f.t("【苏梦忆】", "哎呀，活动要开始了！我不能让他们等太久，先走啦。"),
                f.t("【李云萧】", "嗯。"),
                f.t("【苏梦忆】", "那晚自修再见。"),
                f.t("【李云萧】", "再见！"),
                f.t("【李云萧】", "（苏梦忆，她刚刚的那句话是什么意思？）"),
                f.t("【李云萧】", "（要是能知道她是什么社团的就好了……）"),
                f.t("【李云萧】", "（哎，我在想些什么啊……）",() => pieces.Count)
                //——背景 消失——
            };
        }

        public override GameNode NextNode()
        {
            //return base.NextNode();
            Finish();
            //return nodeFactory.GetEduNode("");
            return nodeFactory.GetMapNode();
        }

    }
}
