using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S3003 : TextScript
    {
        public S3003(Hashtable gVars, GameObject root, PanelSwitch ps):base(gVars, root, ps) { }
        public override void Init()
        {
            base.Init();
            pieces = new List<Piece>()
            {
                //——背景 夕大校园——
                f.t("【李云萧】", "（原来这就是夕大啊，果然比华欣要大多了。）"),
                //——SE 人声——
                f.t("【李云萧】", "（记得她说是在7号楼……）"),
                f.t("【李云萧】", "（但是这么大校园，哪个是7号楼啊？）"),
                //——背景 寝室楼下——
                f.t("【李云萧】", "（大学的校园构造，真是比迷宫还迷啊……）"),
                f.t("【李云萧】", "（虽然我现在应该是在夕大的4号楼下没错……）"),
                f.t("【李云萧】", "（但是，这好像是女生寝室……）"),
                f.t("【李云萧】", "（太尴尬了……不好进去啊……）"),
                f.t("【李云萧】", "（还是找个从里面出来的女生帮忙吧……）"),
                //——CG 伸出手去拉——
                f.t("【李云萧】", "那个，不好意思，请问这里是4号楼吗？"),
                f.t("【女生】", "是的。"),
                f.t("【李云萧】", "能帮我找个人吗？她住在417，叫欧阳晓芸。"),
                f.t("【女生】", "啊！晓芸啊！嘻嘻，我知道，她是我室友呢。"),
                f.t("【李云萧】", "那真是太好了。"),
                f.t("【女生】", "不过，你是谁？"),
                f.t("【李云萧】", "我是她的……朋友吧……"),
                f.t("【李云萧】", "（也不对，我们只见过两次，不算朋友吧，况且她还欠我那么多钱。）"),
                f.t("【女生】", "是朋~友~啊，嘻嘻，我知道了，你等一下啊！"),
                f.t("【李云萧】", "哦，谢谢。"),
                f.t("【女生】", "欧——阳——晓——芸——"),
                f.t("【李云萧】", "（她就这么直接在楼下叫了么？）"),
                f.t("【欧阳晓芸】", "哎！怎么啦？"),
                f.t("【女生】", "你男朋友在楼下等你！！"),
                f.t("【李云萧】", "噗！！！"),
                f.t("【女生】", "好啦，她马上就下来。"),
                f.t("【李云萧】", "咳咳，我不止她男朋友啊，你这样说，等会引起误会了怎么办？"),
                f.t("【女生】", "能有什么误会，我就帮你到这啦，拜拜。"),
                f.t("【李云萧】", "喂！喂！"),
                f.t("【李云萧】", "我真的不是她男朋友啊。"),
                f.t("【李云萧】", "（完了，有人开始往这里看了……）"),
                f.t("【李云萧】", "（赶紧转过身躲一躲……）"),
                f.t("【？？？】", "猜猜我是谁？"),
                f.t("【李云萧】", "欧阳——晓芸，你掐到我脖子了。"),
                //——立绘 欧阳——
                f.t("【欧阳晓芸】", "谁让你长这么高，我够不到你的眼睛。"),
                f.t("【李云萧】", "咳咳。"),
                f.t("【欧阳晓芸】", "一大早的，我还以为是谁呢，没想到是你啊！"),
                f.t("【李云萧】", "刚才的男朋友是那个女生擅自说的，我没有假冒你男朋友的意思。"),
                f.t("【欧阳晓芸】", "没关系，慧慧她总这样，一有男生来找我，都会这么喊。"),
                f.t("【李云萧】", "那你真正的男朋友呢？这么做他不生气吗？"),
                f.t("【欧阳晓芸】", "我……还没有交男朋友……"),
                f.t("【李云萧】", "抱歉……"),
                f.t("【欧阳晓芸】", "不说这个了，找我什么事情？"),
                f.t("【李云萧】", "我可是按照约定过来了，钱。"),
                f.t("【欧阳晓芸】", "我都快给忘了，等等……诺，这么多，对不对？"),
                f.t("【欧阳晓芸】", "我还以为你不会来呢……"),
                f.t("【李云萧】", "约定好的事情我一定会遵守的。"),
                f.t("【李云萧】", "（不来的话，我的钱就没了。）"),
                f.t("【欧阳晓芸】", "除了我们班上的两个男生，从来没有别人来找过我，你是第一个。"),
                f.t("【李云萧】", "两个？这么点？"),
                f.t("【欧阳晓芸】", "我读的是外语专业，男生比较少。"),
                f.t("【欧阳晓芸】", "总之，你能来找我，我好开心。"),
                f.t("【李云萧】", "……"),
                f.t("【李云萧】", "拿到钱，我先回去了。"),
                f.t("【欧阳晓芸】", "我送你出校门吧。"),
                f.t("【李云萧】", "不、不用了吧。"),
                f.t("【欧阳晓芸】", "不要因为我是女生就不好意思嘛。"),
                f.t("【李云萧】", "（关键不是这个……）"),
                f.t("【欧阳晓芸】", "校园里的路我比较熟悉，你第一次来肯定绕了半天。"),
                f.t("【李云萧】", "无法反驳，我找了好久才过来……"),
                f.t("【欧阳晓芸】", "还有一些小路可以走的，校外的人都不知道。"),
                f.t("【李云萧】", "那好吧，我跟着你走。"),
                //——背景 学校大门——
                f.t("【李云萧】", "（虽说是走了小路，但走到大门也花了不少时间）"),
                f.t("【李云萧】", "你赶紧回去吧，出了校门，我知道怎么走。"),
                f.t("【欧阳晓芸】", "那我走啦！"),
                f.t("【李云萧】", "嗯，再见！"),
                //——CG 晓芸背影——
                f.t("【李云萧】", "（回过神来，已经是傍晚了）"),
                f.t("【李云萧】", "（一路上，和她说了有很多很多的事情）"),
                f.t("【李云萧】", "（但这也许是最后一次见到她了吧……）",() => pieces.Count)
                //——背景 消失——
            };
        }

        public override GameNode NextNode()
        {
            //return base.NextNode();
            Finish();
            //return nodeFactory.GetEduNode("");
            return nodeFactory.GetMapNode();
        }

    }
}
