using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class T12003 : TextScript
    {
        public T12003(Hashtable gVars, GameObject root, PanelSwitch ps):base(gVars, root, ps) { }
        public override void Init()
        {
            base.Init();
            pieces = new List<Piece>()
            {
                //——背景 走廊——
                f.t("【陆菲菲】", "不不不好啦！喵星人和女生吵起来了！"),
                f.t("【李云萧】", "喵星人他怎么了？"),
                f.t("【苏梦忆】", "怎么了？"),
                f.t("【陆菲菲】", "不知道，总之和一个女生吵起来了！"),
                f.t("【陆菲菲】", "我刚才路过语文办公室门口，发现喵星人在里面。"),
                f.t("【陆菲菲】", "好像和一个女生在争论，好像是试卷被偷了。"),
                f.t("【苏梦忆】", "不会吧，正好语文老师们都不在。"),
                f.t("【陆菲菲】", "应该没错，你们赶紧过去看下吧！"),
                f.t("【苏梦忆】", "好像发生了不太好的事情，李云萧，我们过去看看吧？"),
                f.t("【李云萧】", "没什么兴趣……"),
                f.t("【苏梦忆】", "请等一下！"),
                f.t("【李云萧】", "没办法，过去看看吧。（别这么抓着我的手……）"),
                f.t("【苏梦忆】", "嗯！"),
                //——背景 办公室内——
                f.t("【苏梦忆】", "哇，地上的玻璃！"),
                f.t("【李云萧】", "看来这里发生了不得了的事情了。"),
                f.t("【李云萧】", "（是我的错觉吗？这场景，好像在哪里见过……）"),
                //——立绘 喵星人——
                f.t("【喵星人】", "你胡说！"),
                f.t("【女生】", "我胡说？那你在这里干什么？"),
                f.t("【喵星人】", "老师的办公室又不是你的，我为什么不能来？"),
                f.t("【女生】", "门明明是锁好的，你又是怎么进来的？"),
                f.t("【喵星人】", "李云萧，快救救我！"),
                f.t("【李云萧】", "喵星人，你怎么了？"),
                f.t("【女生】", "你们是谁？赶紧出去！现在这里不能随便进来！"),
                f.t("【李云萧】", "这……"),
                f.t("【苏梦忆】", "我是高二（3）班的班长，他是我们班的学生。"),
                f.t("【女生】", "原来是班长啊，这件事要通知你们班主任。"),
                f.t("【苏梦忆】", "班主任她现在不在学校，所以请你告诉我，我会转达的。"),
                f.t("【李云萧】", "咳咳，我是副班长，保证会公正处理。"),
                f.t("【苏梦忆】", "你什么时候成为——唔——"),
                f.t("【李云萧】", "抱歉，我假装一下！（反正她也不认识我。）"),
                f.t("【喵星人】", "李云萧，你对我太好了！！"),
                f.t("【李云萧】", "（你怎么一上来就让别人救你啊？）"),
                f.t("【李云萧】", "不好意思，这位同学，能不能告诉我，发生了什么事？"),
                f.t("【女生】", "这是很严重的问题！这个家伙想要偷试卷！"),
                f.t("【李云萧】", "偷、偷试卷？"),
                f.t("【苏梦忆】", "这可是相当于作弊的行为啊，华欣会给他处分的！"),
                f.t("【喵星人】", "我知道，可是，我没有做过啊！"),
                f.t("【女生】", "还敢狡辩！"),
                f.t("【李云萧】", "这件事除了你意外，有没有别的人知道？"),
                f.t("【女生】", "暂时没有。"),
                f.t("【李云萧】", "在正式处理前，能不能让我问他一些话？"),
                f.t("【女生】", "可以，就一些。"),
                f.t("【李云萧】", "喵星人，先跟我们说说发生了什么吧。",() => pieces.Count)
                /*
                这里跳转【调查】
                */
            };
        }

        public override GameNode NextNode()
        {
            //return base.NextNode();
            Finish();
            return nodeFactory.FindTextScript("T11002");
            //return nodeFactory.GetMapNode();
        }

    }
}
