using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class T12005 : TextScript
    {
        public T12005(Hashtable gVars, GameObject root, PanelSwitch ps):base(gVars, root, ps) { }
        public override void Init()
        {
            base.Init();
            pieces = new List<Piece>()
            {
                //——背景 走廊——
                f.t("【叶枫婷】", "怎么样，证据确凿！你没话好讲了。"),
                f.t("【李云萧】", "（的确，她的证词中没有什么问题……怎么办？）"),
                f.t("【李云萧】", "（只能用下这一招了……）"),
                f.t("【李云萧】", "不对，叶亭风，你自己也有办公室的钥匙。"),
                f.t("【李云萧】", "那么你也有可能进入这里，拿到试卷。"),
                f.t("【李云萧】", "而你的目击证词，完全有可能是在说谎。"),
                f.t("【叶枫婷】", "我就是从进入高中开始，语文成绩一直年级第一的，叶枫婷！"),
                f.t("【李云萧】", "（好厉害……那么其他科目呢？）"),
                f.t("【叶枫婷】", "那是不可能的，因为不止我一个人看到了。"),
                f.t("【李云萧】", "什么？难道还有别的人？"),
                f.t("【叶枫婷】", "没错，当然不止我一个人看到了。"),
                f.t("【叶枫婷】", "门外还有一个人，他跟我一起看到的。"),
                f.t("【李云萧】", "不会吧……"),
                f.t("【叶枫婷】", "我们出去见他。"),
                //——立绘 戚海——
                f.t("【？？？】", "我、我也看到了。"),
                f.t("【李云萧】", "你是？"),
                f.t("【戚海】", "我是高一（6）班的戚海。"),
                f.t("【苏梦忆】", "你一直待在办公室外面吗？"),
                f.t("【戚海】", "没错，因为我也看到了……"),
                f.t("【李云萧】", "（被两人看到……喵星人，我怎么没听你说过……）"),
                f.t("【李云萧】", "对了，你怎么满头大汗？"),
                f.t("【戚海】", "啊，这个刚踢完球，跑回来的。"),
                f.t("【李云萧】", "那么，请你把你看到的告诉我们吧。"),
                //——开始证言：立绘 戚海——
                //～看到了什么 1～
                //——BGM 询问——
                f.t("【戚海】", "大约十几分钟前，我呆在教学楼另一侧。"),
                f.t("【戚海】", "突然“咣当”一声，对面办公室的窗被什么东西打碎了。"),
                //威慑后增加：【我看到窗外的足球很快地飞了过来，砸到了窗户。】
                f.t("【戚海】", "我想一定又是谁闯祸了，就立即跑过来看个究竟。"),
                f.t("【戚海】", "跑到这里的走廊时候，我遇到了叶亭风。"),
                f.t("【戚海】", "我跟在她后面打开了门，然后，就看到喵星人在里面。"),
                //——证言完毕：背景变黑 BGM淡出——
                f.t("【苏梦忆】", "喵星人，你都这样被人看到了……"),
                f.t("【喵星人】", "这个喵……"),
                f.t("【李云萧】", "别急，苏梦忆，喵星人翻窗了这一点无法否认。"),
                f.t("【李云萧】", "但是，现在的重点是他究竟看到了什么。"),
                f.t("【苏梦忆】", "可是这样做，真的有用吗？"),
                f.t("【李云萧】", "我也不知道……"),
                f.t("【李云萧】", "但是我觉得，刚才的话里，好像少了点什么。"),
                f.t("【苏梦忆】", "真的？如此一来……"),
                f.t("【李云萧】", "只能期望不要是我的错觉了……",() => pieces.Count),
                /*
                这里跳转【询问】
                */
            };
        }

        public override GameNode NextNode()
        {
            //return base.NextNode();
            Finish();
            return nodeFactory.FindTextScript("T11002");
            //return nodeFactory.GetMapNode();
        }

    }
}
