using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class T12003 : TextScript
    {
        public T12003(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }
        public override void InitText()
        {
            
            pieces = new List<Piece>()
            {
                //——背景 走廊——
                f.t("陆菲菲", "不不不好啦！喵星人和女生吵起来了！"),
                f.t("李云萧", "喵星人他怎么了？"),
                f.t("苏梦忆", "怎么了？"),
                f.t("陆菲菲", "不知道，总之和一个女生吵起来了！"),
                f.t("陆菲菲", "我刚才路过语文办公室门口，发现喵星人在里面。"),
                f.t("陆菲菲", "好像和一个女生在争论，好像是试卷被偷了。"),
                f.t("苏梦忆", "不会吧，正好语文老师们都不在。"),
                f.t("陆菲菲", "应该没错，你们赶紧过去看下吧！"),
                f.t("苏梦忆", "好像发生了不太好的事情，李云萧，我们过去看看吧？"),
                f.t("李云萧", "没什么兴趣……"),
                f.t("苏梦忆", "请等一下！"),
                f.t("李云萧", "没办法，过去看看吧。（别这么抓着我的手……）"),
                f.t("苏梦忆", "嗯！"),


                f.FadeinBackground("office"),
                f.TimeSwitch("？月？日", "办公室"),
                f.ShowChapter("Chapter01"),
                f.OpenDialog(),
                f.t("李云萧","[66ccff]（这现场真是凌乱啊……）[-]"),
                f.t("喵星人", "这是办公室，我为什么不能来？","ch4"),
                f.TransCharacterSprite(0,"ch5"),
                f.t("女生", "门明明是锁好的，你又是怎么进来的？"),
                f.t("李云萧","[66ccff]（刚才站在门外，就能听到里面的声音……）[-]"),
                f.t("李云萧","[66ccff]（果然是喵星人……）[-]"),
                f.t("苏梦忆","喵星人，我带李云萧过来了。"),
                f.t("女生", "你们是谁？赶紧出去！这里不能随便进来！"),
                f.t("苏梦忆", "我是高二（3）班的班长，他是我们班的。"),
                f.t("女生", "原来是班长啊，你来的正好，这件事要通知你们班主任。"),
                f.t("苏梦忆", "班主任她现在不在学校，所以有什么事情，由我来代为处理。"),
                f.t("女生", "那好吧，但这是很严重的教学事件！"),
                f.t("女生", "这个家伙想要偷放在办公室桌上的试卷！"),
                f.t("喵星人", "我没有！","ch4"),
                f.t("女生", "还敢狡辩！"),
                f.t("喵星人", "没有就是没有！","ch4"),
                f.t("李云萧","你是三岁小孩么……"),
                f.t("李云萧","[66ccff]（话虽如此，不知道为什么，\n我自内心觉得喵星人是无辜的。）[-]"),
                f.t("李云萧","那么这位同学，你既然这么肯定，一定有着什么证据？"),
                f.t("女生", "那当然！"),
                f.t("李云萧", "在正式处理前，能不能让我问他一些话？"),
                f.t("女生", "可以，就一些。"),
                f.TransCharacterSprite(0,"ch4"),
                f.t("喵星人", "又要来了吗，你最擅长的推理。"),
                f.t("李云萧","没有到擅长那种地步，只是游戏玩得多了点。"),
                f.t("李云萧","以及你说“又”，难道我之前已经做了什么吗？"),
                f.t("喵星人", "那是在[ff6600]正式版[-]中的事情了，你想不起来就不要去想了。"),
                f.t("李云萧","[66ccff]（正式版？）[-]"),
                f.TransCharacterSprite(0,"ch3"),
                f.t("苏梦忆", "那我又要成为你的助手了。"),
                f.t("李云萧", "[66ccff]（“又”？还有助手是什么鬼？）[-]"),
                f.t("李云萧","不过，能先告诉我你的名字吗？"),
                f.t("苏梦忆","啊！抱歉，抱歉。"),
                f.t("苏梦忆","我是苏梦忆啦，我都忘记你失忆了这设定了。"),
                f.t("李云萧","你知道这件事？"),
                f.t("苏梦忆", "我当然知道啊，因为这是[ff6600]试玩版[-]啊。"),
                f.t("李云萧","[66ccff]（试玩版？）[-]"),
                f.t("苏梦忆", "好啦，喵星人还等着你呢。"),
                f.TransCharacterSprite(0,"ch4"),
                f.t("喵星人", "先帮我摆脱困境吧。"),
                f.t("", "[00ff00]接下来将会进入游戏的核心之一，侦探模式。[-]"),
                f.t("", "[00ff00]在这一模式中，你需要充当侦探的角色，去发掘事件的真相。[-]"),
                f.t("", "[00ff00]比如，搜索遗留在现场的证据，收集不同的证人的证言。[-]"),
                f.t("", "[00ff00]可能有些不知所措，那么请先与喵星人对话吧。[-]"),
                f.t("", "[00ff00]由于是试玩版，只开放了部分功能，\n请点击下方的按钮进行操作。[-]"),
                f.PlayBGM("Examine"),



                //——背景 办公室内——
                f.t("苏梦忆", "哇，地上的玻璃！"),
                f.t("李云萧", "看来这里发生了不得了的事情了。"),
                f.t("李云萧", "（是我的错觉吗？这场景，好像在哪里见过……）"),
                //——立绘 喵星人——
                f.t("喵星人", "你胡说！"),
                f.t("女生", "我胡说？那你在这里干什么？"),
                f.t("喵星人", "老师的办公室又不是你的，我为什么不能来？"),
                f.t("女生", "门明明是锁好的，你又是怎么进来的？"),
                f.t("喵星人", "李云萧，快救救我！"),
                f.t("李云萧", "喵星人，你怎么了？"),
                f.t("女生", "你们是谁？赶紧出去！现在这里不能随便进来！"),
                f.t("李云萧", "这……"),
                f.t("苏梦忆", "我是高二（3）班的班长，他是我们班的学生。"),
                f.t("女生", "原来是班长啊，这件事要通知你们班主任。"),
                f.t("苏梦忆", "班主任她现在不在学校，所以请你告诉我，我会转达的。"),
                f.t("李云萧", "咳咳，我是副班长，保证会公正处理。"),
                f.t("苏梦忆", "你什么时候成为——唔——"),
                f.t("李云萧", "抱歉，我假装一下！（反正她也不认识我。）"),
                f.t("喵星人", "李云萧，你对我太好了！！"),
                f.t("李云萧", "（你怎么一上来就让别人救你啊？）"),
                f.t("李云萧", "不好意思，这位同学，能不能告诉我，发生了什么事？"),
                f.t("女生", "这是很严重的问题！这个家伙想要偷试卷！"),
                f.t("李云萧", "偷、偷试卷？"),
                f.t("苏梦忆", "这可是相当于作弊的行为啊，华欣会给他处分的！"),
                f.t("喵星人", "我知道，可是，我没有做过啊！"),
                f.t("女生", "还敢狡辩！"),
                f.t("李云萧", "这件事除了你意外，有没有别的人知道？"),
                f.t("女生", "暂时没有。"),
                f.t("李云萧", "在正式处理前，能不能让我问他一些话？"),
                f.t("女生", "可以，就一些。"),
                f.t("李云萧", "喵星人，先跟我们说说发生了什么吧。")
                /*
                这里跳转调查
                */
            };
        }

        public override GameNode NextNode()
        {
            //return base.NextNode();
            Finish();
            return nodeFactory.FindTextScript("T11002");
            //return nodeFactory.GetMapNode();
        }

    }
}
