using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S43_01 : TextScript
    {
        public S43_01(DataManager manager, GameObject root, PanelSwitch ps) : base(manager, root, ps) { }

        public override void InitText()
        {
            pieces = new List<Piece>()
            {
                f.OpenDialog(),
                //——背景 教室——
                f.t("孙老师","那么今天的课就到这里，下课！"),
                f.t("李云萧","[66ccff]（可以吃饭去了，走吧……）[-]"),
                f.t("孙老师","李云萧，你帮我把东西拿到办公室去。"),
                f.t("李云萧","好的。"),
                //——背景 离开音乐教室——               
                f.t("李云萧","…………"),
                f.t("李云萧","[66ccff]（嗯？那个走来的好像是隔壁班的……）[-]"),
                f.t("音乐老师","诶，你下课啦？"),
                f.t("孙老师","终于给这帮高二的讲完了。"),
                f.t("音乐老师","上回市里的钢琴比赛，我们又获奖了！"),
                f.t("孙老师","真的？那太好了！"),
                f.t("音乐老师","就是车小曼得奖的，奖状还在我这里呢。"),
                f.t("孙老师","明明高三了，还来这里练琴也真是难得啊。"),
                f.t("音乐老师","对了，这位同学！"),
                f.t("李云萧","啊，说的是我吗？"),
                f.t("音乐老师","对，就是你，孙老师的学生对吧。"),
                f.t("音乐老师","麻烦你帮我把这个，交给高三（6）的车小曼。"),
                f.t("李云萧","啊啊？"),
                f.t("孙老师","李云萧，这件事就交给你做了，期末我会给你加分的！"),
                f.t("李云萧","[66ccff]（这算是利诱么？）[-]"),
                f.t("李云萧","好的，我跑一趟。"),
                f.t("李云萧","[66ccff]（车小曼啊……这算是巧合么）[-]"),
                //——背景 教学楼走廊——
                f.t("李云萧","不愧是高三的教室啊，走廊都这么安静。"),
                f.t("李云萧","大概都在认真地学习吧。"),
                f.t("李云萧","[66ccff]（啊，正好有人从教室里出来了！）[-]"),
                //——立绘出现——
                f.t("李云萧","不好意思，请问你们班的车小曼在吗？"),
                f.t("女生","你等一下啊。"),
                //——立绘消失——
                f.t("女生","车小曼！车小曼！有人找！"),
                f.t("李云萧","…………"),
                //——立绘出现——
                f.t("女生","好像不在的样子。"),
                f.t("李云萧","那你能不能帮我……"),
                f.t("女生","啊！我估计她可能去天台了。"),
                f.t("女生","我现在有些事情，你要么去那里找找看吧。"),
                f.t("李云萧","额，也行……"),
                //——立绘消失——
                f.t("李云萧","[66ccff]（唔……天台？我都没去过楼顶呢。）[-]"),
                f.t("李云萧","[66ccff]（再说，她去天台做什么？）[-]"),
                //——背景 教学楼天台——
                f.t("李云萧","呼——呼——要死了——"),
                f.t("李云萧","[66ccff]（爬楼梯真的累啊……还好我没有恐高……）[-]"),
                //——CG 俯瞰教学楼——
                f.t("李云萧","[66ccff]（没想到这里的风景意外地好看。）[-]"),
                f.t("李云萧","[66ccff]（这里的风吹着号舒服啊……有点想睡觉了……）[-]"),
                f.t("李云萧","吸气——"),
                f.t("？？？","安静点！"),
                f.t("李云萧","什么？"),
                f.t("李云萧","[66ccff]（正当我四周寻找声音的来源之时，从头上传来了声音——）[-]"),
                f.t("？？？","是你！"),
                //——CG 站在天台上的车小曼（风吹起长发一手捂着裙子）——
                f.t("李云萧","没想到你真的在这里，车小曼。"),
                f.t("车小曼","你不是那天来偷看我弹琴的……"),
                f.t("李云萧","慢着！那怎么叫“偷看”啊？音乐厅又没有上锁，谁都可以进来不是么？"),
                f.t("车小曼","呵呵呵"),
                f.t("李云萧","对了，正事，这个奖状给你。"),
                f.t("车小曼","奖状？"),
                f.t("李云萧","好像是钢琴独奏的，受某个老师委托的。"),
                f.t("车小曼","是那场比赛啊，谢谢你，你拿回去吧。"),
                f.t("李云萧","哦……拿、拿回去？这不太好吧……"),
                f.t("车小曼","……"),
                f.t("李云萧","那个，比赛是你赢的，自然……"),
                f.t("车小曼","这种东西没什么好稀罕的……"),
                f.t("车小曼","你如果喜欢就留着，我没什么兴趣。"),
            };
        }

        public override GameNode NextNode()
        {
            Finish();
            return nodeFactory.GetMapNode();
        }

    }
}