using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class T12_001 : TextScript
    {
        public T12_001(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }

        public override void InitText()
        {
            pieces = new List<Piece>()
            {
                //——背景 音乐厅后台——
                f.OpenDialog(),
                f.t("李云萧","……"),
                //——立绘 喵星人-校服-微笑——
                f.t("喵星人","李云萧，在发什么呆呢？"),
                f.t("李云萧","我在想一些事情……"),
                f.t("李云萧","奇怪，你没去找你的雪雪大人吗？"),
                f.t("喵星人","没有，我还没有傻到会直接过去。"),
                f.t("喵星人","如果我去的话，一定会被赶出来。"),
                f.t("李云萧","没想到你还是有自知之明的。"),
                f.t("喵星人","其实是这种好事，要和你一起分享。"),
                f.t("李云萧","免了，我对偶像什么的不感兴趣。"),
                f.t("喵星人","对了，李云萧，你跟西门吹什么关系？"),
                f.t("李云萧","关系？什么意思？"),
                f.t("喵星人","不知道你注意了没，她看你的眼神不一样。"),
                f.t("李云萧","有、有吗，完全没注意。"),
                f.t("李云萧","我是第一次见到她。"),
                f.t("喵星人","哦，是吗？那我就放心了。"),
                f.t("喵星人","但是，她现在可是人气偶像哦。"),
                f.t("喵星人","按照我所知的套路，她绝对是对你有些意思。"),
                f.t("李云萧","你这是哪门子的套路……"),
                f.t("喵星人","这绝对是人气偶像和普通高中生的恋爱展开。"),
                f.t("喵星人","我好气啊……"),
                f.t("李云萧","轻小说看多了吧。"),
                f.t("喵星人","可恶啊，为什么是如此可爱的偶像，还对你……"),
                f.t("李云萧","你脑补过头了吧……"),
                f.t("喵星人","对了，说起来你怎么看蔡助理？"),
                f.t("李云萧","你是说她对另一人的态度？"),
                f.t("喵星人","没错，我感觉那种态度绝对很奇怪。"),
                f.t("李云萧","你发现什么了？"),
                f.t("喵星人","总感觉，助理有些偏心。"),
                f.t("李云萧","是啊……"),
                f.t("喵星人","要么去找小雪要签名吧！"),
                f.t("李云萧","你不是刚说你不回去碰壁的吗？"),
                f.t("喵星人","不管了，走起……"),
                f.t("喵星人","你先去舞台那边等我吧，我会马上回来的！"),
                f.t("李云萧","……"),
                //——背景 音乐厅正面——
                f.t("李云萧","彩排还有30分钟就要开始了。"),
                f.t("喵星人","李、李云萧！我回来了！"),
                f.t("李云萧","办完了？"),
                f.t("喵星人","对！小雪的声音真好听。"),
                f.t("李云萧","没想到，你居然真的要到签名了。"),
                f.t("喵星人","嘿嘿、厉害吧！双人组合，自然要两个人的签名。"),
                f.t("喵星人","这样一来，两个人的签名我都拿到了。"),
                f.t("李云萧","让我看看……"),
                f.t("喵星人","不给，你自己去要!"),
                f.t("李云萧","……"),
                f.t("喵星人","我错了，给！你别弄坏了！"),
                //——CG 手中拿着2个人的签名——
                f.t("李云萧","原来，吹雪是取了两个人的名字。"),
                f.t("喵星人","西门吹的吹，和慕容雪的雪，组合成吹雪。"),
                f.t("喵星人","而且她们两个都是复姓，能成为组合也算是奇迹了吧。"),
                f.t("李云萧","（刚刚在准备室里，我们见到了组合的另一名成员。）"),
                f.t("李云萧","话说她们两人都和我们同年龄，不用上学的吗。"),
                f.t("喵星人","我想，应该是要的吧？"),
                f.t("喵星人","有专门的培训学校，和我们以升学为主的学校不同。"),
                f.t("李云萧","完全不同的路啊。"),
                f.t("李云萧","现在这里只有些工作人员，到了晚上，应该会坐满吧？"),
                f.t("喵星人","那是自然，据我了解，我们学校的粉丝可多了。"),
                f.t("李云萧","有这么夸张吗？"),
                f.t("喵星人","你到时候就知道了！"),
                f.t("李云萧","回去了，签名也拿到了，等到晚上再来吧。"),
                f.t("喵星人","你不看下彩排吗？"),
                f.t("李云萧","我就不看了，想给晚上留点惊喜。"),
                f.t("李云萧","看过预演，等晚上正式演出的时候，就没有那种感动了。"),
                f.t("喵星人","随你便吧。"),
                //——背景 教室——
                f.t("李云萧","……"),
                //——SE 冲开门——
                f.t("？？？","李！"),
                f.t("李云萧","！又来？"),
                //——立绘 喵星人 流汗——
                f.t("喵星人","快、快……快起来！"),
                f.t("李云萧","怎、怎么了？气喘吁吁的样子？"),
                f.t("喵星人","出……出……大……大……"),
                f.t("李云萧","给，你先喝口水，慢慢说。"),
                f.t("喵星人","咕咚——"),
                f.t("李云萧","现在这个时间，不应该开始彩排了吗？怎么回来了？"),
                f.t("喵星人","出事了！大事不好了！"),
                f.t("李云萧","哈？发生什么了？"),
                f.t("喵星人","跟我来，你去了就知道。"),
                //——SE 跑步——
                f.t("李云萧","哇，你倒是说清楚啊！"),
                //——SE 关门——
                f.FadeoutAll()
            };
        }

        public override GameNode NextNode()
        {
            Finish();
            return nodeFactory.FindTextScript("T21_002");
        }

    }
}
