using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S0002 : TextScript
    {
        public S0002(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }

        public override void InitText()
        {
            pieces = new List<Piece>()
            {
                //——背景 后排视角的教室——
                f.OpenDialog(),
                f.t("李云萧","[66ccff]（今天是开学的第一天……）[-]"),
                f.t("李云萧","[66ccff]（现在是早上的7点15分，还没有到上课的时间……）[-]"),
                f.t("喵星人","哈——"),
                f.t("李云萧","怎么了，昨晚没睡好？"),
                f.t("喵星人","你这不是废话喵？昨晚12点才睡的，今早6点多就被你吵醒了！"),
                f.t("李云萧","是你自己睡得太晚了……"),
                f.t("喵星人","哟，看不出来，你换了我们的校服，还挺不错啊。"),
                f.t("李云萧","挺合身的。"),
                f.t("喵星人","对了，等会广播一响，就可以去操场参加升旗仪式了。"),
                //——SE 广播——
                f.t("李云萧", "你指的就是这个广播么？来得还真快啊。"),
                f.t("喵星人", "走咯，升旗去咯喵！"),
                //——背景 足球场——
                f.TransBackground("ground"),
                f.t("李云萧", "[66ccff]（排在了队伍的最后，身后不时有老师走过……）[-]"),
                f.t("李云萧", "[66ccff]（升旗仪式也是件令人提心吊胆的事。）[-]"),
                f.t("李云萧", "[66ccff]（在升国旗，唱国歌后，由学生代表上台讲话。）[-]"),
                f.t("李云萧", "……"),
                f.t("？？？", "各位同学，各位老师，大家早上好……"),
                f.t("李云萧", "喵星人，上面讲话的男人是？"),
                f.t("喵星人", "他是我们的校长，叶校。"),
                f.t("李云萧", "原来是校长……等等他是校长！？"),
                f.t("李云萧", "他看过去好年轻啊。"),
                f.t("喵星人", "对啊，他可是全市最年轻的校长了，了不起吧？"),
                f.t("喵星人", "忘记告诉你了，他以前负责教我们化学课。"),
                f.t("李云萧", "不会吧，校长直接教书？"),
                f.t("喵星人", "虽然他是高高在上的校长，但同时依旧是一名老师。"),
                f.t("叶校长", "在这秋高气爽的九月，我希望同学们能够在新的学期里……"),
                f.t("李云萧", "[66ccff]（果然，新学期的致辞都是差不多的……）[-]"),

                f.t("李云萧", "……"),
                //——背景 后排视角的教室——
                f.TransBackground("classroom"),
                f.t("李云萧", "终于回到教室了，操场好远啊。"),
                f.t("李云萧", "从小到大，领导上台讲话都是这么长。"),
                f.t("喵星人", "是啊，这么多年了，都已经习惯了。"),
                f.t("李云萧", "[66ccff]（马上就要开始在这里学习了，也不知道老师上得怎么样。）[-]"),
                f.t("李云萧", "喵星人，第一节是什么课？"),
                f.t("喵星人","没有课。"),
                f.t("李云萧","没有课？"),
                f.t("喵星人","枫溪采用的是主动学习制，没有给学生安排课程。"),
                //显示EDU界面
                f.t("喵星人","但是身为学生，最重要的自然还是学习。"),
                f.t("喵星人","接下来，我给你介绍[ff6600]能力提升[-]模式。"),
                f.t("喵星人", "画面左侧是[ff6600]学习面板[-]，选择并[ff6600]点击[-]按钮就可以进行。"),
                f.t("喵星人", "鼠标置于其上方时，会显示该行动的简介。"),
                f.t("李云萧", "那么中间的课表是？"),
                f.t("喵星人", "这张表上会显示今天会有老师辅导的科目。"),
                f.t("喵星人", "如果你的选择和今天的辅导科目[ff6600]一致[-]，那么学习效率将会[ff6600]大幅提高[-]。"),
                f.t("李云萧", "我明白了，只要选择就行了是吗……"),
                //f.t("喵星人", "然而，今天能做的，第二天不一定能。\n每天的[ff6600]学习项目[-]会发生改变。"),
                f.t("喵星人", "另外，华欣是相当自由的，你完全可以选择自己想做的事情。"),
                f.t("李云萧", "[66ccff]（这么说，我可以[ff6600]不上课[-]？）[-]"),
                f.t("李云萧", "那右边的几个数值是什么意思？"),
                f.t("喵星人", "那是学校的系统对于你学习能力的综合评价数值。"),
                f.t("喵星人", "数值越大意味着你的对应能力越高，而[ff6600]考试排名[-]则是[ff6600]综合[-]了平时成绩和你的真实考试。"),
                f.t("喵星人", "需要注意的是[ff6600]体力值[-]，体力小于一定数值，会导致身心疲惫，严重时就会生病。"),
                f.t("喵星人", "而且，体力越低，行动[ff6600]失败[-]的可能性就越大。"),
                f.t("李云萧", "那我该怎么[ff6600]恢复[-]体力值呢？"),
                f.t("喵星人", "平时的教学安排十分紧凑，对我们来说分秒必争。"),
                f.t("喵星人", "放假的时候，没有教学上的压力，一定要注意休息回复。"),
                f.t("喵星人", "人的时间精力有限，你要合理安排好。"),
                f.t("李云萧", "我明白了……"),
                f.t("喵星人", "当然，有的时候，不在状态也会导致效率下降。"),
                f.t("喵星人", "需要注意自己的学习动力，如果出现了不好情绪状态，尽快寻求心理辅导的帮助。"),
                f.t("喵星人", "好了喵，我的说明结束了，想想该学点什么吧。"),
                f.t("李云萧", "诶？容我想想……"),
                f.t("李云萧", "[66ccff]（那么，今天要做些什么呢？）[-]")
                //——背景 消失——
            };
        }

        public override GameNode NextNode()
        {
            Finish();
            return nodeFactory.GetEduNode();
        }

    }
}
