using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S0001_3 : TextScript
    {
        public S0001_3(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }

        public override void InitText()
        {
            pieces = new List<Piece>()
            {
                f.OpenDialog(),
                f.t("","好！这样你就学会了[ff6600]大地图[-]的使用方法了。"),
                f.t("","因为今天比较特殊，所以就简简单单让你[ff6600]触发了[-]事件。"),
                f.t("","之后的生活中，只有满足[ff6600]一定的条件[-]，\n在[ff6600]特定的地点[-]才会发生。"),
                f.t("","些地方虽然可以[ff6600]点击[-]，但是不一定有好事情。"),
                f.t("","详细内容可以在[ff6600]电子校园卡[-]里查看。"),
                f.t("李云萧","喂，你一下子说这么多我记不住啊！"),
                f.FadeinBackground("qs1"),
                f.t("喵星人","没想到啊，我终于不是一个人了！"),
                f.t("李云萧","[66ccff]（在我回到了学校安排给我的寝室后，听到的第一句就是……）[-]"),
                f.t("喵星人","……"),
                f.t("喵星人","怎么是你！？"),
                f.t("李云萧","…………"),
                f.t("李云萧","这是我的台词吧？"),
                f.t("李云萧","我也没想到，跟我同住的竟然是你……"),
                f.t("喵星人","从今天起，我们俩就是好基友了！"),
                f.t("李云萧","离我远点！！"),
                f.t("李云萧","不过，说回正事，为什么你是一个人住？"),
                f.t("李云萧","在我进来之前，这里是没有人的吧？"),
                f.t("喵星人","这个嘛，本来是有个室友的。"),
                f.t("喵星人","所有的学生都是两个人一间寝室，我也不例外。"),
                f.t("李云萧","半路转学了？"),
                f.t("喵星人","不，是开学的时候，有个男生没有来报道。"),
                f.t("喵星人","至于结果，你也看到了，就是现在这个样子。"),
                f.t("李云萧","应该说你运气好还是运气差呢……"),
                f.t("李云萧","总之，从今以后，请你多指教！"),
                f.t("喵星人","我也是，以后你有什么不懂，尽管来问我。"),
                f.t("喵星人","话说……听你说你喜欢推理？"),
                f.t("李云萧","喜欢是喜欢，怎么了……"),
                f.t("李云萧","[66ccff]（有种不祥的预感……）[-]"),
                f.t("喵星人","告诉你……这个学校里……"),
                f.t("李云萧","你别吓我……"),
                f.t("喵星人","有着七大不可思议！"),
                f.t("李云萧","鬼才信！！"),
                f.t("李云萧","怎么哪里都是七大不可思议，就不能是八个九个吗！"),
                f.t("喵星人","你看，动漫里都这么说的。"),
                f.t("喵星人","晚上图书馆会有诡异的灯光，医务室会动的假人……"),
                f.t("李云萧","那都是假的啊！"),
                f.t("喵星人","看来有必要让你亲自去体验一下。"),
                f.t("李云萧","……"),
                f.t("喵星人","你完全没听是吧！"),
                f.t("李云萧","还有啊，我只是推理游戏玩得多，我自己没推理能力的。"),
                f.t("喵星人","……"),
                f.t("李云萧","你也没听是吧！"),
                f.t("喵星人","那么，这样吧，我下回一定要让你体验一下。"),
                f.t("喵星人","刚开学肯定很空，要不我们下周去吧？"),
                f.t("李云萧","好吧……"),
                f.t("喵星人","我饿了，走走走，吃饭去！"),
                f.t("李云萧","啊？现在？现在才3点啊……"),
                f.t("喵星人","嗯，刚开学去几楼吃呢？"),
                f.t("李云萧","[66ccff]（被他完全无视了……）[-]"),
                f.t("李云萧","喂！喵星人！等等我！"),
                //变黑
                f.t("李云萧","这便是我第一天进入枫溪的情形。"),
                f.t("李云萧","崭新的学期即将开始，新的一页即将开始书写。"),
                f.t("李云萧","而我将在这里，留下最深的记忆——")
                //——可以插入OP了——
            };
        }

        public override GameNode NextNode()
        {
            //return base.NextNode();
            Finish();
            return nodeFactory.FindTextScript("S0002");
        }

    }
}
