using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S0001_1 : TextScript
    {
        public S0001_1(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }
        public override void InitText()
        {

            pieces = new List<Piece>()
            {
                //——背景 学校正门——
                f.ChangeBackground("gate"),
                f.TimeSwitch("8月30日","枫溪外国语学校"),
                f.PlayBGM("popsky", 0.1f),
                f.OpenDialog(),
                f.t("李云萧","[66ccff]（呼……呼……终于来到这所学校了……）[-]"),
                f.t("李云萧","[66ccff]（出现在我眼前的是枫溪外国语学校。）[-]"),
                f.t("李云萧","[66ccff]（不愧是重点高中，校门就不一样。）[-]"),
                f.t("李云萧","[66ccff]（今天是八月的最后一天，明天就正式开学了。）[-]"),
                f.t("李云萧","[66ccff]（其实，我是从其他学校转过来的，至于原因嘛，以后会讲。）[-]"),
                f.t("李云萧","[66ccff]（枫溪……接下来的生活，全在这里了……）[-]"),
                f.t("李云萧","[66ccff]（但愿不要遇到奇怪的事情。）[-]"),
                //——背景 广场——
                f.OpenDialog(),
                f.t("李云萧","——半小时后——"),
                f.t("李云萧","[66ccff]（姑且把行李先放在了寝室里，接下来，先去下新班级的教室比较好。）[-]"),
                f.t("李云萧","[66ccff]（根据学校发给我的文件，新加入的班级是——高二（3）班）[-]"),
                f.t("李云萧","[66ccff]（刚才看了一下指示牌，高二年级，好像是在3楼和4楼。）[-]"),
                f.TransBackground("corridor"),
                f.t("李云萧","[66ccff]（将主要的入学手续办好后，我决定前往所在班级的教室。）[-]"),
                f.t("李云萧","[66ccff]（来的路上，问了下路过的学生，好像是在3楼的样子。）[-]"),
                f.t("李云萧","高二（6），高二（5），高二（4）……到了，高二（3）班！"),
                //——SE 嘈杂的人声——
                f.t("李云萧","[66ccff]（唔，其他人都已经在教室里了么？）"),
                f.t("李云萧","[66ccff]（好紧张，该怎么面对新同学呢？）"),
                f.t("李云萧","[66ccff]（不过，在进教室之前，还是先去见一下班主任吧。）"),
                f.t("李云萧","[66ccff]（毕竟，接下来的一段时间，都要和她相处了。）"),
                f.t("李云萧","[66ccff]（我记得，她的办公室应该就在教室的旁边……）"),
                f.t("李云萧","应该就是这里了吧……"),
                //——SE 敲门——
                f.t("男老师", "请进。"),
                f.CloseDialog(),
                //——SE 推门——
                //——背景 办公室内景——
                f.TransBackground("office"),
                f.OpenDialog(),
                f.t("李云萧", "请问，郭老师是哪位？"),
                //——立绘 郭老师——
                f.FadeInCharacterSprite(0, "ch7"),
                f.t("郭老师", "我就是，同学你有什么事情吗？"),
                f.t("李云萧", "郭老师，我是新转来的学生，我的名字叫……"),
                f.SetName(),
                f.t("李云萧", "李云萧！"),
                f.t("郭老师","啊~你就是新来的学生啊，我接到学校的通知了！"),
                f.t("郭老师","我是高二（3）班的班主任——郭珊珊，欢迎来到枫溪！"),
                f.t("郭老师","你已经去过学生宿舍了吗？"),
                f.t("李云萧","我已经全部整理好了，我是来报道的。"),
                f.t("郭老师","那就好。"),
                f.t("郭老师","刚来到这里，很陌生吧？"),
                f.t("李云萧","有点……我还没见到和我住一个寝室的同学……"),
                f.t("郭老师","没关系的，等一下就会认识大家的。"),
                f.t("郭老师","呀，我给忘了，你有领到[ff6600]电子学生手册[-]吗？"),
                f.t("李云萧","电子学生手册？"),
                f.t("郭老师","教务处应该会发给你的，没有领吗？"),
                f.t("李云萧","指的是这张电子卡吗？"),
                f.t("郭老师","对对，就是这张卡，它就是[ff6600]电子学生手册[-]。"),
                f.t("李云萧","原来是这样，我还以为是有什么别的用处。"),
                f.t("郭老师","你知道怎么开机吗？可以试试打开它。"),
                f.t("李云萧","怎么开？我从来没用过。"),

                f.t("郭老师", "看到右下角的[ff6600]NOTE按钮[-]了吧。"),
                f.t("郭老师", "平时[ff6600]点击[-]一下就能打开主界面了，\n走路和学习的时候就不要去看了。"),
                f.t("李云萧", "原来如此，我看看……"),
                f.t("郭老师", "不急，你先去教室和同学们见个面吧。"),
                f.t("郭老师", "等一会我来开个班会，到时候需要你做自我介绍。"),
                f.t("李云萧", "我知道了，可是郭老师，教室里有多余的位置吗？"),
                f.t("郭老师", "哎呀！瞧我这记性。"),
                f.t("郭老师", "时间也差不多了，干脆你和我一起去吧。"),
                f.t("李云萧", "好的。"),
                f.FadeoutAll(),
                //——背景 讲台视角的教室——
                f.FadeinBackground("classroom"),
                f.OpenDialog(),
                //——无立绘 头像——
                f.t("李云萧","[66ccff]（都是陌生的脸……）[-]"),
                f.t("女生","他是谁啊？"),
                f.t("女生","不知道，没见过。"),
                f.t("男生","不会是转校生吧？"),
                f.t("男生","但是这种时候还有转校吗？"),
                f.t("？？？","大家安静一下——"),
                f.t("李云萧","[66ccff]（不从是哪里传来了声音，整个教室瞬间静了下来。）[-]"),
                f.t("郭老师","同学们，从明天开始，新的学期就到来了。"),
                f.t("郭老师","在开始今天的班会前，有一个消息要告诉大家。"),
                f.t("学生","开学要考试？"),
                f.t("郭老师","从今天开始，我们班将多一名新的成员。"),
                f.t("学生","……"),
                f.t("郭老师","那么，接下来，我们掌声有请他来自我介绍一下。"),
                f.t("李云萧","[66ccff]（轮、轮到我了吗……）[-]"),
                f.t("李云萧","[66ccff]（终于、终于轮到这一刻了！）[-]"),
                f.t("李云萧","大家好，我的名字叫李云萧，因为搬家的关系，才转到了华欣外国语学校。"),
                f.t("李云萧","我的爱好是游戏与推理，希望能在接下来的时间中和大家成为朋友。"),
                //——SE 掌声——
                f.t("郭老师","常感谢李云萧同学，也希望同学们能友好相处。"),
                f.t("郭老师","嗯——教室里只剩下最后一整排空着了……"),
                f.t("郭老师","要么你坐靠窗的那个位置吧。"),
                f.t("李云萧","[66ccff]（靠窗的座位，也不错……）[-]"),
                //——背景 后排视角的教室——
                f.SetCharacterSprite(0, "c11_1", "left"),
                //——立绘 郭老师——
                f.t("郭老师","这个暑假，同学们…………"),
                f.t("李云萧","[66ccff]（在简短的开场白后，老师开始对上个学期进行了总结。）[-]"),
                f.t("？？？","哟，新来的——"),
                f.t("李云萧","[66ccff]（果然不管在哪个学校，新学期的开场白都如此地相似。）[-]"),
                f.t("？？？","喂！(#`O′)"),
                f.t("李云萧","嗯？叫我吗？"),
                f.t("？？？","不叫你叫谁啊喵？"),
                f.t("李云萧","哦，怎么了？"),
                f.t("李云萧","[66ccff]（以及，他刚才说了“喵”，我没听错吧……）[-]"),
                f.t("？？？","嘻嘻，你叫李云萧喵？"),
                f.t("李云萧","是的，你好。"),
                f.t("喵星人","你好，我叫喵星人。"),
                f.t("李云萧","喵星人？好奇怪的名字……"),
                f.t("喵星人","你怎么连你也这么说，和我当初刚进来的时候一样，"),
                f.t("苗星任","我姓苗，苗疆的苗，天上的星，重任的任。"),
                f.t("李云萧","是这样啊，抱歉，因为发音太……"),
                f.t("喵星人","和“喵星人”谐音，所以大家都叫我喵星人，我还蛮喜欢的。"),
                f.t("李云萧","……"),
                f.t("喵星人","怎么愣住了喵？"),
                f.t("李云萧","你这个算是恶意卖萌吗？"),
                f.t("喵星人","你说呢？╮(╯▽╰)╭"),
                f.t("李云萧","[66ccff]（颜文字都出来了啊，喂！）[-]"),
                f.t("喵星人","你才刚来，可能对华欣不太熟悉。"),
                f.t("李云萧","我只知道是这里有名的重点中学，其他的事情就不太清楚了。"),
                f.t("喵星人","说对了一半，枫溪的确是市里的一级重点高中……"),
                f.t("喵星人","但是我们学校，和其他的重点高中还是有区别的。"),
                f.t("李云萧","哦？有什么区别？"),
                f.t("郭老师","苗星任！"),
                f.t("喵星人","！！"),
                f.t("郭老师","你的暑假作业做完了没有？！"),
                f.t("喵星人","做、做完了！！！"),
                f.t("郭老师","很好，等会由你带领班上的男生去领这学期的教材。"),
                f.t("郭老师","好了，班会到这里结束。"),
                f.t("郭老师","希望同学们回去好好准备下，明天开始正式上课。"),
                f.t("学生","知道了！"),
                //——SE 关门——
                f.t("喵星人","呼……差点被发现了……"),
                f.t("李云萧","让你开小差……"),
                f.t("喵星人","还不是因为和你说话！"),
                f.t("李云萧","[66ccff]（明明是你转过头来和我讲话的！）[-]"),
                //——CG 喵星人振臂高呼——
                f.t("喵星人","咳咳，男同胞们，跟我一起去领书！！"),
                f.t("男生","又是我们几个啊……诶，走啦！走啦！"),
                f.t("李云萧","想不到，你还蛮有号召力的。"),
                f.t("喵星人","还有你，也一起去！"),
                f.t("李云萧","我也要去？"),
                f.t("喵星人","当然！你已经是我们班级的人了，是男的都要去！"),
                f.t("李云萧","知道啦！"),
                f.t("李云萧","[66ccff]（于是，我跟随着喵星人，还有班上的男生，离开了教室……）[-]"),
                f.t("李云萧","[66ccff]（可能，我朝着这个新的大家庭，迈出了我的第一步。）[-]"),
                f.CloseDialog(),
                f.StopBGM(),
                f.FadeoutAll(),
                //——背景 消失——
            };
        }

        public override GameNode NextNode()
        {
            Finish();
            return nodeFactory.FindTextScript("S0001_2");
        }

    }
}
