using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S22_02A : TextScript
    {
        public S22_02A(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }

        public override void InitText()
        {
            pieces = new List<Piece>()
            {
                //——背景 食堂——
                f.OpenDialog(),
                f.t("李云萧","…………好吧。"),
                f.t("李云萧","你别用这种眼神看着我，怪受不了的的。"),
                f.t("喵星人","太好了，我就知道你会同意的！"),
                //——背景 艺术楼走廊——
                f.t("喵星人","到啦！"),
                f.t("李云萧","（一路跟着喵星人来到了学校的艺术楼。）"),
                f.t("喵星人","就是这里了。"),
                f.t("李云萧","（他将我带到了一扇没有标识的门前。）"),
                f.t("李云萧","这扇门是通往哪的？"),
                f.t("喵星人","嘿嘿、秘密。"),
                f.t("李云萧","话说，门上不是贴着“工作人员专用”吗？"),
                //——SE 门上锁的声——
                f.t("喵星人","果然是上锁了。"),
                f.t("李云萧","喵星人！你有没有在听我的话？"),
                f.t("喵星人","别急，看我的秘密武器。"),
                //——SE 开门声——
                f.t("喵星人","好啦，进去吧。"),
                f.t("李云萧","居然打开了，你哪里来的钥匙？"),
                f.t("喵星人","我们先进去，我一会再跟你说明。"),
                //——背景 舞台后台——
                f.t("李云萧","这里好像是音乐厅……"),
                f.t("喵星人","没错，这里就是后台啦。"),
                f.t("李云萧","可以告诉我了吗，你怎么会有那扇门的钥匙的？"),
                f.t("喵星人","这个嘛，说来话长。"),
                f.t("李云萧","不会是偷来的吧？"),
                f.t("喵星人","怎么可能，我像是会去偷东西的人吗？"),
                f.t("李云萧","说不定。"),
                f.t("李云萧","那么，说好的她们已经到了呢？"),
                f.t("喵星人","唔、唔……"),
                f.t("喵星人","奇怪啊，我的情报理论上是准确的……"),
                f.t("？？？","你们在这里干什么？"),
                f.t("李云萧","！！"),
                f.t("喵星人","糟糕，被人发现了！"),
                //——立绘 西门吹-私服-生气——
                f.t("？？？","你们是怎么进来的？这里只有工作人员才进！"),
                f.t("喵星人","这、这个……"),
                f.t("李云萧","抱歉，我们不是有意的。"),
                f.t("喵星人","对对，我们是看到门没关上就进来了。"),
                f.t("李云萧","事实可不是这样啊……"),
                f.t("喵星人","先糊弄过去吧……是吧，李云萧？"),
                f.t("李云萧","额……"),
                f.t("喵星人","既然有人在了，那我们就放心了。"),
                f.t("喵星人","我们先走一步……"),
                f.t("？？？","等等！"),
                f.t("喵星人","（倒吸一口）"),
                f.t("喵星人","怎、怎么了？"),
                f.t("？？？","你、你，你是李云萧？"),
                f.t("李云萧","嗯？你、你是？"),
                f.t("喵星人","你们，原来认识？"),
                f.t("李云萧","不认识啊，我才刚转学过来。"),
                f.t("李云萧","（我不记得有认识这样的人啊……）"),
                //——立绘 西门吹-私服-哀伤——
                f.t("？？？","……"),
                f.t("？？？","哦，可能是我认错了。"),
                f.t("李云萧","不过，稍等一下……"),
                f.t("李云萧","你是怎么知道我叫李云萧的？"),
                //——立绘 西门吹-私服-惊讶——
                f.t("？？？","！！"),
                //——立绘 西门吹-私服-哀伤——
                f.t("？？？","啊！我刚听到他这么叫你的……"),
                f.t("李云萧","你既然没有穿校服，应该不是我们学校的学生。"),
                f.t("？？？","蔡助理，你回来啦。"),
                f.t("李云萧","（助理？）"),
                f.t("蔡助理","阿吹，发生什么事情了吗？ "),
                f.t("李云萧","（阿吹……是名字吗？）"),
                //——立绘 蔡助理——
                f.t("蔡助理","请问你们几位是？"),
                f.t("喵星人","我们是枫溪高二年级的学生。"),
                f.t("蔡助理","学生？难道你们老师没告诉你们，今天这里不能进吗？"),
                f.t("李云萧","抱歉，我们是擅自……"),
                f.t("喵星人","啊——是的，我们不知道这里不能进，平日这里都是开放的。"),
                f.t("蔡助理","哦，既然这样，现在你们知道了吧。"),
                f.t("蔡助理","到晚上为止，除了有工作证的人，一律不准进入。"),
                f.t("李云萧","（工作证？指的是她自己脖子上挂着的证件吗？）"),
                //——立绘 慕容雪-校服-轻视——
                f.t("？？？","怎么了，发生什么了？"),
                f.t("喵星人","怎么又来一个！"),
                f.t("蔡助理","是小雪啊，没什么事情。就是这些学生……"),
                f.t("？？？","学生？学生不是不能进入吗？"),
                f.t("蔡助理","不好意思，是我疏忽了。"),
                f.t("？？？","你是怎么搞的？"),
                f.t("蔡助理","对不起，责任在我。"),
                f.t("李云萧","（怎么感觉，瞬间气势就没有了。）"),
                f.t("蔡助理","我马上和负责老师联系下……"),
                f.t("李云萧","不用联系了，我们离开就是。"),
                //——立绘 西门吹-私服-惊讶——
                f.t("阿吹","蔡助理，等一下，他们是我的朋友，特意来看我的。"),
                f.t("喵星人","喵？"),
                f.t("李云萧","啊？"),
                //——立绘 慕容雪-私服-疑惑——
                f.t("？？？","朋友？"),
                f.t("蔡助理","阿吹，我怎么不知道？"),
                f.t("阿吹","对不起，之前没有告诉你，他们真的是我的好朋友。"),
                f.t("蔡助理","可是，就算是朋友也不行啊，万一惊动了其他人怎么办？"),
                f.t("阿吹","不会的，只有他们几个，不会影响到我的。"),
                f.t("蔡助理","这很难办啊……"),
                f.t("阿吹","求你了，蔡助理~"),
                f.t("蔡助理","……"),
                f.t("蔡助理","…………"),
                f.t("蔡助理","好吧好吧。"),
                f.t("蔡助理","你们几个，注意不能影响一会儿的彩排！"),
                f.t("喵星人","哦，知道了。"),
                f.t("蔡助理","小雪啊，我们先去准备化妆吧。"),
                f.t("小雪","知道了！"),
                //——SE 脚步——
                f.t("蔡助理","小雪，你等我一下！"),
                //——SE 脚步——
                f.t("小雪","你们跟我来。"),
                //——背景 西门吹的准备室——
                f.t("喵星人","哇——好大的房间。"),
                f.t("李云萧","没想到学校的音乐厅后面，还有这种样的房间。"),
                //——立绘 西门吹-私服-微笑——
                f.t("阿吹","这里是蔡助理帮我临时布置的。"),
                f.t("李云萧","总之，刚才多谢你了。"),
                //——立绘 西门吹-私服-哀伤——
                f.t("阿吹","嗯……"),
                f.t("喵星人","吹吹大人，请给我一个签名吧！"),
                f.t("阿吹","呵呵呵，没问题。"),
                f.t("李云萧","（哈？吹吹大人？）"),
                f.t("喵星人","我是你忠实的粉丝，每次视频我都会投硬币！"),
                f.t("李云萧","……"),
                f.t("阿吹","你呢，李云萧？"),
                f.t("喵星人","他的那一份就不用了，给我多签一份吧？"),
                f.t("李云萧","喂……"),
                f.t("阿吹","这样可以吗？"),
                f.t("李云萧","给他吧，我无所谓。"),
                f.t("喵星人","吹吹大人，我叫苗星任，苗疆的苗，星星的星，任务的任。"),
                f.t("喵星人","能拜托你，在我的校服上签名吗！"),
                f.t("阿吹","吼吼吼，那我随手在校服上涂鸦吧。"),
                f.t("李云萧","（校服上，没问题么……）"),
                f.t("喵星人","请顺便写上给“喵星人”！！"),
                f.t("阿吹","好、好的。"),
                f.t("李云萧","咳咳，说起来，喵星人。"),
                f.t("喵星人","怎么了喵？"),
                f.t("李云萧","是不是应该给我介绍一下。"),
                f.t("喵星人","啊！太过兴奋，给忘记了！"),
                f.t("阿吹","啊，唔嗯。"),
                f.t("西门吹","我的名字叫西门吹，现在是“吹雪”的一员。"),
                f.t("西门吹","现在的职业是偶像，你们也看到了。"),
                f.t("李云萧","复姓？好少见啊……"),
                f.t("喵星人","是啊，正式因为少见，所以我才成为她的粉丝的！"),
                f.t("李云萧","这么说，“吹雪”组合的另一位是？"),
                f.t("西门吹","哦，你说小雪啊，你们刚才已经见过面了，就刚才和蔡助理走了的那个。"),
                f.t("喵星人","太好了！这下可以亲眼见到雪雪大人了！"),
                f.t("喵星人","我去要签名！"),
                f.t("西门吹","呵呵呵。"),
                f.t("李云萧","喂……你不要随便过去啊！"),
                f.t("李云萧","（一股脑地冲了出去……）"),
                f.t("李云萧","哎……"),
                f.t("西门吹","唔……那、那个……"),
                f.t("李云萧","什么？"),
                f.t("西门吹","不、没什么……"),
                f.t("李云萧","那我先不打扰你了，祝你演出成功。"),
                //——立绘 西门吹-私服-哀伤——
                f.t("西门吹","……"),
                f.t("西门吹","…………"),
                f.t("西门吹","你真的不记得我了吗……"),
                f.FadeoutAll()
            };
        }

        public override GameNode NextNode()
        {
            Finish();
            return nodeFactory.FindTextScript("S22_03");
        }

    }
}
