using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S12_01 : TextScript
    {
        public S12_01(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }

        public override void InitText()
        {            
            pieces = new List<Piece>()
            {
                //大礼堂背景
                f.FadeinBackground("classroom"),
                f.TimeSwitch(manager.GetTodayText(),"大礼堂"),
                f.OpenDialog(),
                f.t("李云萧", "[66ccff]（枫溪外国语作为一所完全中学，新生入学后的第二周必须要参加新生安全讲座。）[-]"),
                f.t("李云萧", "[66ccff]（我虽然已是高二，但由于转校生的身份，也要参加新生会。）[-]"),
                f.t("李云萧", "[66ccff]（这次新生会的大致内容，先是由负责高一年纪的老师和学生会协力介绍学校的规章制度与教学安排）[-]"),
                f.t("李云萧", "[66ccff]（而地点，就是目前我身处的，嘈杂的纪念大礼堂。）[-]"),
                f.t("李云萧", "[66ccff]（临近大会的开始，初一与高一的新生乌泱泱地涌了进来，陆陆续续地坐在了我的身后。）[-]"),                
                f.t("李云萧", "[66ccff]（没想到喵星人居然是学生会的人，他正在忙于联络每个新生班的班长，商量座位的划分。）[-]"),                
                f.t("李云萧", "[66ccff]（不管怎么样，都要感谢喵星人提前给我安排了这第一排的位置——）[-]"),
                f.t("李云萧", "[66ccff]（但……这不是贴着学生会纸条吗！是学生会全体的座位吗。）[-]"),
                f.t("男生", "高一（6）班，6班班长！在吗？"),
                f.t("？？？", "到！"),
                f.t("李云萧", "（这声音……好像是……）"),
                //CG 苏的侧面
                f.t("？？？", "我们高一（6）班的人数是47人，今天全员都到齐了，没有请假的情况。"),
                f.t("男生", "既然这样，从第四排开始到第八排，从左开始坐满。"),
                f.t("？？？", "第4排到第8排是吗？好的，我知道了。"),
                f.t("男生", "好，注意让大家保持安静！"),
                f.t("？？？", "是。"),
                f.t("男生", "请各班班长注意！在安排好班级的座位后，统一坐到第一排。"),
                f.t("李云萧", "……"),
                f.t("喵星人", "我回来了！"),
                f.t("李云萧", "事情办完了？"),
                f.t("喵星人", "搞定了，刚才你在看什么呢？"),
                f.t("李云萧", "没什么……"),
                f.t("喵星人", "难不成在新生之中，有好看的妹子？让我也看看！"),
                f.t("李云萧", "看招！"),
                f.t("喵星人", "唔啊，我错了！"),
                f.t("喵星人", "啊！教务主任还有老师们来了！"),
                f.t("李云萧", "[66ccff]（顺着喵星人的眼睛看去，首先进来的是几位穿着正装的中年男女。）[-]"),
                f.t("李云萧", "[66ccff]（新生大会要开始了……）[-]"),
                f.FadeoutAll(),
                f.FadeinBackground("classroom"),
                f.TimeSwitch("同日 上午","大礼堂"),
                f.OpenDialog(),
                f.t("李云萧", "[66ccff]（漫长的安全讲座和新生教育后，老师们离开了这里。）[-]"),
                f.t("喵星人", "接下来的就是我们的工作了。"),
                f.t("李云萧", "那我可以走了吗？"),
                f.t("喵星人", "当然是不行，你要留下来帮忙。"),
                f.t("李云萧", "喂……"),
                //苏 立绘
                f.t("？？？", "请问，刚才老师说的“学生手册”是在这里领吗？"),
                f.t("喵星人", "你好，请问是哪个班？"),
                f.t("李云萧", "高一（6）班，在你左手边的那个箱子里。"),
                f.t("喵星人&？？？", "咦？你怎么知道我是高一（6）班的？/r/n欸，你是怎么知道在那个箱子里的？"),
                f.t("李云萧", "你们两个别一起问，一个一个来。"),
                f.t("李云萧", "你是高一（6）班的班长吧。"),
                f.t("苏梦忆", "是的，我叫苏梦忆，高一（6）班。"),
                f.t("李云萧", "你的话，是因为我听到了你向学生会汇报班级人数，就记住了。"),
                f.t("李云萧", "至于你，我刚才趁着无聊的时候，瞄了一眼你脚边。"),
                f.t("李云萧", "那个纸箱子上面不是写着“5-8”，我想那大概就是4个班级的东西了。"),
                f.t("喵星人&苏梦忆", "好厉害！"),
                f.t("李云萧", "[66ccff]（说着，我和喵星人从箱子里将未拆分的学生手册交给了她。）[-]"),
                f.t("女生", "苏梦忆，赶紧回去吧，一些男生不耐烦了！"),
                f.t("苏梦忆", "我知道了，我拿完就回。"),
                f.t("李云萧", "要不要我帮你拿一叠过去？"),
                f.t("喵星人", "量有点多，要不你去高一（6）的地方，一起帮忙分发吧。"),
                f.t("苏梦忆", "不用了，我能拿走的。"),
                f.t("李云萧", "没关系，剩下的我会拿去的，你先去管理班级吧。"),
                f.t("苏梦忆", "嗯。"),
                f.CloseDialog(),
                f.FadeinBackground("礼堂后排"),
                f.OpenDialog(),
                f.t("男生", "太慢了！我们能回去了吗？"),
                f.t("男生", "就是，会不是已经开完了吗？"),
                f.t("苏梦忆", "各位同学不要急，马上就结束了。"),
                f.t("男生", "还要等多久啊？"),
                f.t("李云萧", "[66ccff]（哇，快控制不住了。）[-]"),
                f.t("女生", "你们几个安静一点，这样吵吵闹闹的怎么听清！"),
                f.t("男生", "戚——"),
                f.t("苏梦忆", "谢谢你。"),
                f.t("李云萧", "[66ccff]（那位女生，对管理好像很有经验的杨样子……）[-]"),
                f.t("苏梦忆", "接下来，请叫到名字的同学，一个个上来领。"),
                f.t("李云萧", "[66ccff]（终于在另一位女生的帮助下，整个班级稍微恢复了一点秩序。）[-]"),
                f.t("苏梦忆", "已经拿到的同学，可以先回去了！"),
                f.t("李云萧", "[66ccff]（听到这句话后，不满渐渐消退了。）[-]"),
                //转场
                f.t("苏梦忆","呼……终于发完了。"),
                f.t("女生","苏梦忆，跟你说，不能对男生太过于放纵，要严厉！"),
                f.t("苏梦忆","可是……"),
                f.t("女生","没有可是，不然你这个班长会没有威信力的！"),
                f.t("女生","我可是过来人，看你如此软弱，一定会蹬鼻子上脸的。"),
                f.t("李云萧","（说的没错，我以前所在的班级也是那样。）"),
                f.t("女生","你是第一次当班长，不了解那些顽皮的男生。"),
                f.t("李云萧","（第一次啊，肯定遇到了很多阻力吧，那么我的任务也完成了……）"),
                f.t("李云萧","东西发完了，任务完成，我先回去了。"),
                f.t("苏梦忆","谢谢！"),
                f.t("女生","谢谢学长！"),
                f.t("苏梦忆","那个，学长能不能告诉我你的名字？"),
                f.t("李云萧","我，我的名字？"),
                f.t("喵星人","这家伙名叫李云萧，如果有事找他，就来我们高二（3）班吧。"),
                f.t("李云萧","喵星人，你什么时候来的？"),
                f.t("喵星人","我看你一直不回来，就过来找你了。"),
                f.t("苏梦忆","李云萧，学长，我记住了！今天谢谢你了！"),
                f.t("李云萧","哦……哦，不用谢！"),
                f.t("苏梦忆","那么两位学长，我们先告辞了！"),
                f.t("喵星人","拜拜！"),
                f.t("李云萧","嗯，再见！"),
                f.t("喵星人","你这是怎么成功的？"),
                f.t("李云萧","成功什么？我只是拿着东西站在哪里而已。"),
                f.t("喵星人","想不到你这人还有两把刷子，这么快就认识新学妹了！"),
                f.t("李云萧","信不信我打你……"),
                f.t("喵星人","名字叫什么，苏、苏什么来着？"),
                f.t("李云萧","苏梦忆。"),
                f.t("喵星人","对对对，苏学妹！"),
                f.t("喵星人","你就不想再见她一面吗？"),
                f.t("李云萧","额……"),
                f.t("李云萧","（不过说真的，不知道有没有机会再见她一面。）"),
                f.t("喵星人","这回工作做完了，帮我把剩下的东西拿回去吧。"),
                f.t("李云萧","就这么点？自己搬回去！"),
                f.t("喵星人","你就这么抛弃了我！你个负心汉！"),
                f.t("李云萧","这是你们学生会的工作，我只是个转校的新生啊~"),
                f.t("喵星人","我……算你狠！"),
                f.t("李云萧","[66ccff]（我才不会管喵星人，直接跑回了教室！）[-]"),
                f.FadeoutAll()
            };
        }

        public override GameNode NextNode()
        {
            Finish();
            return nodeFactory.GetEndTurnNode();
        }

    }
}
