using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S13_01 : TextScript
    {
        public S13_01(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }

        public override void InitText()
        {
            pieces = new List<Piece>()
            {
                f.FadeinBackground("classroom"),
                f.TimeSwitch(manager.GetTodayText(),"高二（3）班 教室"),
                f.OpenDialog(),
                f.t("李云萧", "[66ccff]（这几天喵星人好像特别忙碌，也不知道在忙些什么。）[-]"),
                //喵星人 立绘
                f.t("李云萧", "回来啦，大忙人！"),
                f.t("喵星人", "真的累死我了，正好赶上时间了。"),                
                f.t("喵星人", "这几天正好是学生会换届的日子，升入高三的学长学姐们要渐渐退出了。"),                
                f.t("喵星人", "虽然我们高二学生作为第一候补，但还是缺大量的人手。"),
                f.t("李云萧", "这么严重的吗？为什么？"),
                f.t("喵星人", "枫溪学生数量较多，且实行的是住宿制，学校的一些工作需要依靠学生会完成。"),
                f.t("喵星人", "与一般学校不同，学生会的存在是非常重要的。"),
                f.t("李云萧", "这我还真的不知道，一般来讲学生会不是一个权力架空的社团组织吗？"),                
                f.t("喵星人", "那也是事实，学生会虽然无法直接影响学校的教学安排，但是——"),
                f.t("喵星人","枫溪的学生活动节日庆典等，只要经过老师的批准，就全权交由学生会组织进行。"),
                f.t("李云萧", "所以，学生会有多少人？"),
                f.t("喵星人", "宣传部、体育部、纪检部、生活部、学习部、文娱部，每个部门约10人左右。"),                
                f.t("喵星人", "再加上主席团和组织部，大概百人不到吧。"),
                f.t("李云萧", "哇，比我想象的要多。"),
                f.t("喵星人", "帮我个忙，我统计不过来了。"),
                f.t("李云萧", "[66ccff]（我对学生会并不是很感兴趣，但也不能当作没看见喵星人的请求。）[-]"),
                f.t("李云萧", "我怎么帮你？"),
                f.t("喵星人", "这里是这次有意向加入学生会的人的简历……"),
                f.t("李云萧", "[66ccff]（交到我手上的是一叠并不多的简历，上面贴有每位学生的照片和基本信息。）[-]"),
                f.t("李云萧", "就这么点？"),
                f.t("喵星人", "也不是所有的学生都对学生会有兴趣的，每年都差不多，只有这么点。"),
                f.t("喵星人", "再说，这已经是经过一次筛选了的。"),
                f.t("喵星人", "对了，李云萧，帮我按照年级先分开来。"),
                f.t("李云萧", "[66ccff]（于是，我便开始根据每个人的班级，将简历分成了几堆。）[-]"),
                //加入转场
                f.t("李云萧", "[66ccff]（渐渐地，我在名单上发现了一个熟悉的名字。）[-]"),    
                f.t("李云萧", "这个是！！"),
                f.t("喵星人", "嗯嗯，怎么了？"),
                f.t("李云萧", "你看。"),
                //苏的申请书
                f.t("喵星人", "这不是那谁吗？她怎么也来了？"),
                f.t("李云萧", "苏梦忆，现任高一（6）班的班长，第一志愿申请的是宣传部……"),
                f.t("喵星人", "宣传部？等一下，好像宣传部的部长是……"),
                f.t("喵星人", "不好，快到招新说明开始的时间了！"),
                f.t("李云萧", "怎么了，这么慌张？是你担当面试官？"),
                f.t("喵星人", "并不是，但是，身为学生会的一员，我也要出场的。"),
                f.t("喵星人", "有了！你和我一起去旁听吧！"),
                f.t("李云萧", "说实话没什么兴趣……"),
                f.t("喵星人", "会有很多新来的女生哦！"),
                f.t("李云萧", "那是你的兴趣好吧……"),
                f.t("喵星人", "你也能见到苏梦忆学妹！"),
                f.t("李云萧", "！！"),
                f.t("李云萧", "……"),
                f.t("喵星人", "这么好的机会，你不去吗？")
            };
        }

        public override GameNode NextNode()
        {
            Finish();
            Dictionary<string, string> dic = new Dictionary<string, string>();
            dic.Add("犹豫", "S13_01A");
            dic.Add("想见她", "S13_02");
            return nodeFactory.GetSelectNode(dic);
        }

    }
}
