using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class S14_01 : TextScript
    {
        public S14_01(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }

        public override void InitText()
        {
            pieces = new List<Piece>()
            {
                //——背景 教室——
                f.FadeinBackground("class"),
                f.TimeSwitch(manager.GetTodayText()+" 上午10：30","高二（3）班"),
                f.OpenDialog(),
                f.t("李云萧","[66ccff]（转入这所学校已经2周了，但是……）[-]"),
                f.t("女生","喂喂，告诉我，你们学校的校服都是这样的吗？"),
                f.t("李云萧","是。"),
                f.t("李云萧","[66ccff]（今天我把以前学校的校服穿了出来，结果全变成了这个样子……）[-]"),
                f.t("女生","和枫溪的制服完全不一样。"),
                f.t("李云萧","[66ccff]（大概也是因为我是转校生的关系吧，大家都围了过来……）[-]"),
                f.t("女生","诶，那你之前的那个高中是什么样子的？"),
                f.t("李云萧","高一没什么感觉，从初中部直接升上来的。"),
                f.t("女生","那、那——"),
                f.t("喵星人","嘿！各位，你们有什么问题来问我吧！"),
                f.t("女生","欸？为什么？"),
                f.t("喵星人","李云萧他不爱说话，你们这么围着他，什么也问不出来的！"),
                f.t("喵星人","但是，我可是知道李云萧的全部事情喵！他私下全部告诉我了！"),
                f.t("李云萧","你给我等一下，你什么时候这么了解我了？"),
                f.t("李云萧","[66ccff]（这家伙的名字叫苗星任，因为谐音的关系，叫他喵星人。）[-]"),
                f.t("李云萧","[66ccff]（喵星人似乎知道学校的任何事情，自称枫溪的活数据库。）[-]"),
                f.t("李云萧","[66ccff]（两周前，我第一次来到这里的时候，遇到的第一个人也是他……）[-]"),
                f.t("女生","真的吗？那我问你……"),
                f.t("喵星人","别急别急，一个一个问。"),
                f.t("陆菲菲","嗯哼！"),
                f.t("李云萧","[66ccff]（这个特有的咳嗽声是？）[-]"),
                f.t("陆菲菲","今天要进行语文的单元测试，你们两个知道了吗？"),
                f.t("喵星人","什么？单元测试？"),
                f.t("李云萧","[66ccff]（她的名字叫陆菲菲，是我们班的班长兼喵星人的同桌，坐在我的前面。）[-]"),
                f.t("陆菲菲","[66ccff]（之前和她就有过一面之缘，只是没有想到，我会被分配到这个班。）[-]"),
                f.t("喵星人","你说什么喵？"),
                f.t("陆菲菲","单元测试啊。"),
                f.t("喵星人","我怎么没有听说过？"),
                f.t("李云萧","上课没听。"),
                f.t("李云萧","[66ccff]（另外，喵星人的语文成绩很差，这几乎是全班都知道的事情。）[-]"),
                f.t("喵星人","李云萧，快救我喵！"),
                f.t("李云萧","别看我，我刚转学过来，是第一次参加考试……"),
                f.t("喵星人","陆菲菲，求你了喵！"),
                f.t("陆菲菲","不行！"),
                f.t("喵星人","别这样喵！"),
                f.t("陆菲菲","不行就是不行！"),
                f.t("李云萧","[66ccff]（就这样两个人纠缠了好一会……）[-]"),
                //同日 上午11：40 高二（3）教室
                f.t("老师","好了，停笔！交卷！"),
                f.t("李云萧","[66ccff]（果然，还是好难……语文，我也不行……）[-]"),
                f.t("喵星人","完了喵……"),
                f.t("李云萧","[66ccff]（不知道从哪里传来了悲鸣……）[-]"),
                f.t("陆菲菲","怎么了？"),
                f.t("喵星人","唉……"),
                f.t("李云萧","别去想了，都结束了。"),
                f.t("李云萧","我们去食堂吧！"),
                f.t("喵星人","你们先去吧喵，我还有点事情。"),
                f.t("陆菲菲","诶，可是……"),
                f.t("李云萧","算了，走吧。"),
                f.t("李云萧","[66ccff]（我对着班长，摇了摇头）[-]"),
                f.t("喵星人","喵星人他，到底干什么去了？"),
                f.t("李云萧","估计不是什么好事情，但愿他别惹什么麻烦。"),
                f.t("陆菲菲","别这么说，喵星人可是非常善良的。"),
                f.t("李云萧","你和他从以前就认识了？"),
                f.t("陆菲菲","我们初中的时候就认识了，所以我很清楚。"),
                f.t("陆菲菲","对了，去不去暑假里刚刚开业的三楼？"),
                f.t("李云萧","好。"),
                //——背景 3楼食堂 楼梯口——
                f.t("李云萧","[66ccff]（不愧是私立的重点学校，光是食堂，就开了三层楼。）[-]"),
                f.t("李云萧","[66ccff]（另外，新开的三楼是类似西餐厅一样的食堂，非常高级。）[-]"),
                f.t("陆菲菲","孙老师好！许老师好！"),
                f.t("李云萧","老师们好！"),
                f.t("孙老师&许老师","哎，你们好！"),
                f.t("李云萧","[66ccff]（由于我并不认识其中的任何一位，只能附和着，说句“老师好”。）[-]"),
                f.t("李云萧","那两个老师你都认识吗？"),
                f.t("陆菲菲","一个是教高一的老师，还有一个是负责高三的。"),
                f.t("陆菲菲","因为我经常去语文办公室，所以整个办公室的老师都认得我。"),
                f.t("李云萧","真厉害啊……"),
                f.t("陆菲菲","我也好想去教师食堂啊！"),
                f.t("李云萧","教师食堂，在哪里？"),
                f.t("陆菲菲","继续往前走，右手边的就是了，学生食堂则在左手边。"),
                f.t("李云萧","难怪会在楼梯上遇到老师。"),
                f.t("陆菲菲","是的，这可是3楼餐厅的唯一的弊端呢。"),
                f.t("李云萧","[66ccff]（难道不是价格吗，应该不便宜吧……）[-]"),
                f.t("陆菲菲","我们去点餐吧！"),
                f.t("李云萧","[66ccff]（午饭的时间很快就结束了，只是没有想到……）[-]"),
                f.t("李云萧","[66ccff]（我对喵星人的担忧，很快便成为了现实。）[-]"),
                f.FadeoutAll()
            };
        }

        public override GameNode NextNode()
        {
            Finish();
            return nodeFactory.FindTextScript("T12_01");
        }

    }
}
