using Assets.Script.GameStruct;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

namespace Assets.Script.TextScripts
{
    public class demo21 : TextScript
    {
        public demo21(DataManager manager, GameObject root, PanelSwitch ps):base(manager, root, ps) { }
        public override void InitText()
        {
            pieces = new List<Piece>()
            {
                f.OpenDialog(0),
                f.t("叶婷", "又、又怎么了？"),
                f.t("李云萧", "叶婷，你知道从这里到办公室要多久吗？"),
                f.t("叶婷", "要多久？"),
                f.t("李云萧", "5分钟。"),
                f.t("叶婷", "5分钟又怎么了？"),
                f.t("李云萧", "你出门时，恰好遇到了戚海超。"),
                f.t("李云萧", "你们两人一起目击了喵星人，没错吧？"),
                f.t("叶婷", "是的。"),
                f.t("李云萧", "问题是，戚海超是什么时候和你汇合的呢？"),
                f.t("李云萧", "威海超，这一点，你知道吗？"),
                f.t("戚海超", "这个、这个……我不清楚……"),
                f.t("叶婷", "这还用说，当然是窗户被打碎后。"),
                f.t("李云萧", "这是不可能的。"),
                f.t("叶婷", "为什么？"),
                f.t("李云萧", "你觉得，他为什么会来这里？"),
                f.t("李云萧", "他可是低年级的学生，他的教室可不在这层。"),
                f.t("叶婷", "这个我不知道。"),
                f.t("李云萧", "今天，办公室的窗户被足球砸碎了。"),
                f.t("叶婷", "难道！难道是！"),
                f.t("李云萧", "没错，正如你所想。"),
                f.t("李云萧", "踢出这一球的，就是威海超！"),
                f.t("叶婷", "这，这不可能……"),
                f.t("李云萧", "这是足球队员告诉我们的。\n[66ccff]（虽然没有直接告诉我们。）[-]"),
                f.t("李云萧", "因为他自己弄碎了窗户，所以才谎称自己在教学楼的另一侧。"),
                f.t("叶婷", "！？"),
                f.t("李云萧", "我们假定在12点整，窗户被砸碎了。"),
                f.t("李云萧", "此时的你，正好出现在走廊上。"),
                f.t("李云萧", "但是，威海超从操场跑道教室花了5分钟。"),
                f.t("叶婷", "唔！！"),
                f.t("李云萧", "也就说，你们相遇的真实时间是，12点05分左右。"),
                f.t("李云萧", "那么，早在12点就听到声音的你，"),
                f.t("李云萧", "为什么在5分钟之后，才去开办公室的门！"),
                f.t("叶婷", "这个、这个……我、我……"),
                f.t("叶婷", "不、不是这个，是因为……"),
                f.t("叶婷", "哇，这怎么样都好！"),
                f.t("苏梦忆", "李、李云萧，她、她已经语无伦次了。"),
                f.t("叶婷", "喵星人拿着试卷这一点，是无可争辩的事实！"),
                f.t("李云萧", "我承认这是事实——"),
                f.t("李云萧", "但这并不能说明是他预谋偷走试卷。"),
                f.t("李云萧", "而且，有一样证据，现在被赋予了新的意义。"),
                f.t("叶婷", "什么、是什么证据？"),
                f.t("李云萧", "而且，有一样证据，现在被赋予了新的意义。"),
                f.t("李云萧", "这个是掉在桌底下的试卷，是从试卷袋里拿出来的。"),
                f.t("李云萧", "这上面有些碎玻璃在上面。"),
                f.t("叶婷", "！！！"),
                f.t("李云萧", "就是说，这样东西掉在地上的时间，是早于玻璃破碎的。"),
                f.t("李云萧", "真正打开档案袋的人，在12点前，就在办公室里了。"),
                f.t("叶婷", "那喵星人也有可能12点之前就在办公室了。"),
                f.t("李云萧", "是有这个可能。"),
                f.t("李云萧", "一开始，我没法确定他是否在说谎。"),
                f.t("李云萧", "但是现在，有另一个人，在他之前就去过办公室了。"),
                f.t("李云萧", "这是你自己的证言，11点50分去办公室交了作业。"),
                f.t("李云萧", "相比于喵星人，更加可疑的是你才对！"),
                f.t("叶婷", "啊！啊啊啊啊啊啊！"),
                f.t("李云萧", "这回，不会是又记错了吧？"),
                f.t("叶婷", "我、我、我可什么事没有做！"),
                f.t("李云萧", "真的吗？"),
                f.t("叶婷", "难道你、你能证明我在说谎吗？"),
                f.t("李云萧", "大概能！"),
                f.t("叶婷", "什！什么？"),
                f.t("李云萧", "[66ccff]（看来事件，要接近尾声了……）[-]")
                //f.t("李云萧", "既然你什么也没做，\n那就请你说一下你去交作业的情况吧。"),
            };
        }

        public override GameNode NextNode()
        {
            Finish();
            return nodeFactory.FindTextScript("demofin");
            //return nodeFactory.GetEnquireNode("demoZ05");
        }

    }
}
